---
kind: method
id: M:Autodesk.Revit.DB.Rectangle.IsNormalized
source: html/17a31054-4132-dd48-4f8a-e793aeefe673.htm
---
# Autodesk.Revit.DB.Rectangle.IsNormalized Method

Returns true if the rectangle coordinates are normalized to the screen coordinate space; that is, left is less than right and top is less than bottom.

## Syntax (C#)
```csharp
public bool IsNormalized()
```